Control_Test/Darrious/Lenz/CFD_Test/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);
internalField1   uniform (8 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    "(VAWT1|VAWT2|VAWT3|SHAFT)"
    {
        type            movingWallVelocity;
        value           $internalField;
    }
    top
    {
        type            fixedValue;
        value           $internalField1;
    }
    bottom
    {
        type            fixedValue;
        value           $internalField1;
    }
    front
    {
	type            empty;
    }
    back
    {
	type            empty;
    }
    AMI1
    {
        type            cyclicAMI;
        value           $internalField;
    }

    AMI2
    {
        type            cyclicAMI;
        value           $internalField;
    }
}

// ************************************************************************* //
